---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DPartFailures.DeletingDPartWillDeleteMorePartsError
source: html/6083689d-dcc4-91b6-59bb-a9d8db1122b1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DPartFailures.DeletingDPartWillDeleteMorePartsError Property

Deleting a Part will delete all associated Parts and the original Element will be made visible.

## Syntax (C#)
```csharp
public static FailureDefinitionId DeletingDPartWillDeleteMorePartsError { get; }
```